In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('croatian.txt', sep=' ', header=None)

In [31]:
df[0].apply(lambda x: x.split('/')[0]).to_csv('cro.txt', index=False)

In [ ]:
df[0].apply(lambda x: x.split('/')[0]).to_csv('cro.dic', index=False)

In [49]:
df = pd.read_csv('croatian.txt', sep=' ', header=None)

In [50]:
df

                 0
0         abažurom
1        abdicirah
2       abdicirahu
3       abdicirala
4       abdicirali
...            ...
377187     žvalite
377188     žvaliti
377189     žveglaj
377190    žvrgolje
377191    žvrgolji

[377192 rows x 1 columns]

In [51]:
df2 = df[df[0].apply(lambda x: x.split('/')[0]).str.contains('č|ć|ž|š|đ')]

In [52]:
df2

                  0
0          abažurom
11        abdiciraš
12       abdiciraše
45       abecediraš
46      abecediraše
...             ...
377187      žvalite
377188      žvaliti
377189      žveglaj
377190     žvrgolje
377191     žvrgolji

[115979 rows x 1 columns]

In [53]:
s3 = df2[0].apply(lambda x: x.split('/')[0]).str.replace('ž','z').str.replace('č','c').str.replace('ć','c').str.replace('š','s').str.replace('đ','d').str.replace('Ž','Z').str.replace('Č','C').str.replace('Ć','C').str.replace('Š','S').str.replace('Đ','D')

In [54]:
s3.to_csv('cro2.dic', index=False)

In [ ]:
# df[0].apply(lambda x: x.split('/')[0]).to_csv('cro.txt', index=False)

In [ ]:
# df[0].apply(lambda x: x.split('/')[0]).to_csv('cro.dic', index=False)

In [55]:
df3 = pd.read_csv('cro2.dic', sep=' ', header=None)

In [56]:
df4 = pd.read_csv('croatian.dic', sep=' ', header=None)

In [57]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 115980 entries, 0 to 115979
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       115980 non-null  object
dtypes: object(1)
memory usage: 906.2+ KB

In [58]:
df3

                 0
0                0
1         abazurom
2        abdiciras
3       abdicirase
4       abecediras
...            ...
115975     zvalite
115976     zvaliti
115977     zveglaj
115978    zvrgolje
115979    zvrgolji

[115980 rows x 1 columns]

In [59]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 377192 entries, 0 to 377191
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       377192 non-null  object
dtypes: object(1)
memory usage: 2.9+ MB

In [60]:
df4

                 0
0         abažurom
1        abdicirah
2       abdicirahu
3       abdicirala
4       abdicirali
...            ...
377187     žvalite
377188     žvaliti
377189     žveglaj
377190    žvrgolje
377191    žvrgolji

[377192 rows x 1 columns]

In [61]:
df5 = pd.concat([df3,df4],ignore_index=True)

In [62]:
df5

                 0
0                0
1         abazurom
2        abdiciras
3       abdicirase
4       abecediras
...            ...
493167     žvalite
493168     žvaliti
493169     žveglaj
493170    žvrgolje
493171    žvrgolji

[493172 rows x 1 columns]

In [63]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493172 entries, 0 to 493171
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       493172 non-null  object
dtypes: object(1)
memory usage: 3.8+ MB

In [64]:
df5.to_csv('cro3.dic', index=False)

In [4]:
df6 = pd.read_csv('croatian.dic', sep=' ', header=None)

In [10]:
df7 = df6.sort_values(by=[0])

In [16]:
df7

               0
0              0
1              0
119531      ANSA
116149     Adame
116151    Adamom
...          ...
493135     žvaču
493136   žvačući
493170   žveglaj
493171  žvrgolje
493172  žvrgolji

[493173 rows x 1 columns]

In [14]:
df8 = df7.drop(0).drop(1)

In [15]:
df8

               0
119531      ANSA
116149     Adame
116151    Adamom
116153   Adamova
116155   Adamove
...          ...
493135     žvaču
493136   žvačući
493170   žveglaj
493171  žvrgolje
493172  žvrgolji

[493171 rows x 1 columns]

In [26]:
df9 = df8.drop(119531)

In [27]:
df9

               0
116149     Adame
116151    Adamom
116153   Adamova
116155   Adamove
116157   Adamovu
...          ...
493135     žvaču
493136   žvačući
493170   žveglaj
493171  žvrgolje
493172  žvrgolji

[493170 rows x 1 columns]

In [28]:
import numpy as np

In [33]:
df10 = df9.set_index(np.arange(0,493170))

In [35]:
df10

               0
0          Adame
1         Adamom
2        Adamova
3        Adamove
4        Adamovu
...          ...
493165     žvaču
493166   žvačući
493167   žveglaj
493168  žvrgolje
493169  žvrgolji

[493170 rows x 1 columns]

In [36]:
df10.to_csv('croatian.dic', index=False)